notes.org
#+hugo_base_dir: .
#+options: author:Aimee

** Rust China                                         :rust:china:@community:
:PROPERTIES:
:EXPORT_FILE_NAME: rust-china
:EXPORT_DATE: 2020-11-20
:EXPORT_HUGO_SECTION: community
:EXPORT_DESCRIPTION: All about Rust China.
:EXPORT_OPTIONS: toc:2
:END:

*** Companies using Rust

- Alibaba & Ant Finance
  - Multiple teams & products
  - [[https://occlum.io/][Occlum]] and the [[https://github.com/occlum/occlum][source]] # ~tee~
- [[https://www.huawei.com/en/][Huawei]]
  - Multiple teams & products
- [[https://www.cryptape.com/][Cryptape]] # ~blockchain~
  - [[https://github.com/nervosnetwork/ckb][CKB]]
- [[https://www.rivtower.com/][RivTower 溪塔科技]] # ~blockchain~
  - [[https://github.com/citahub/cita][CITA]]
- [[https://pingcap.com/][PingCAP]] # ~database~
  - [[https://github.com/tikv/tikv][TiKV]]
- [[https://www.bilibili.com/][Bilibili]] # ~video~ ~social~
- [[https://www.bytedance.com/en/][Bytedance]] # ~video~ ~social~
- [[https://www.zhihu.com/][Zhihu]] # ~forum~
  - [[https://github.com/zhihu/rucene][Rucene]]

*** Conferences

[[https://2020conf.rustcc.cn/][Rust China Conf 2020]] | Shanghai or Shenzhen
- Source code?
- Organizing by [[https://rustcc.cn/][RustCC]] 

[[https://rustcon.asia][RustCon Asia 2019]] | Beijing
- Source code is on [[https://github.com/rustcon-asia/beijing-2019][GitHub]]
- Co-organized by [[https://www.cryptape.com/][Cryptape]] and [[https://pingcap.com/][PingCAP]]
- Announcement: [[https://rustcon.asia/blog/hello-asia/][Hello / 你好 Asia]]
- Recap: [[https://medium.com/@Aimeedeer/a-close-touch-with-rust-community-4a8507b756d9][A Close Encounter with Rust Community]]
- [[https://www.dropbox.com/sh/t6s39rupk492ntq/AACSMbbeE-uYLqqlyJmXXGUPa?dl=0][Photos]]
- [[https://www.youtube.com/watch?v=YSEx8wtlPWc&list=PL85XCvVPmGQjPvweRqkBgnh_HKE5MBB8x][Videos]]

*** GitHub Orgs

- https://github.com/rust-lang-cn
- https://github.com/RustChina
- https://github.com/rust-zh


*** Forums and Channels

**** Forum and media

- Forum RustCC: https://rustcc.cn/
- WeChat news channel: Rust语言学习交流
- Telegram news channel: https://t.me/rust_daily_news

**** Telegram

- https://t.me/rust_zh
- https://t.me/rust_deep_water
- https://t.me/rust_tw  

**** WeChat groups

Invite only because of WeChat's limitation.

**** QQ groups

- Rust编程语言社区1群，群号：303838735 （已满，只能内部邀请）
- Rust编程语言社区2群，群号：813448660
- Rust中文，群号：570065685
- Topics: 专题群：
  - Rust Redox发行版开发群，群号：437268658
  - Rust Data Science 研究小组，群号：681142501
  - Rust webassembly/wasm社区，群号：347929175
  - Rust 论坛开发组，群号：687763184 
   （关于https://rust.cc论坛开发相关讨论）
  - Rust社群-区块链研究，群号：617238820
  - Rust 嵌入式开发，群号：825820683
  - φ Rust图形学，群号：812748521
  - 哲学与计算，群号：446590168
  - Offline meetups: 地方线下聚会群：
    - 北京：305842562
    - 上海：966129249
    - 深圳：673715651
    - 广州：738772514
    - 成都：131080784
    - 重庆：962149536

