content/community/rust-china.md
+++
title = "Rust China"
author = ["Aimee Z"]
description = "All about Rust China."
date = 2020-11-20
tags = ["rust", "china", "community"]
categories = ["community"]
draft = false
[menu.main]
  weight = 2003
  identifier = "rust-china"
+++

<div class="ox-hugo-toc toc">
<div></div>

<div class="heading">Table of Contents</div>

- [Companies using Rust](#companies-using-rust)
- [Conferences](#conferences)
- [GitHub Orgs](#github-orgs)
- [Forums and Channels](#forums-and-channels)
    - [Forum and media](#forum-and-media)
    - [Telegram](#telegram)
    - [WeChat groups](#wechat-groups)
    - [QQ groups](#qq-groups)

</div>
<!--endtoc-->


## Companies using Rust {#companies-using-rust}

-   Alibaba & Ant Finance
    -   Multiple teams & products
    -   [Occlum](https://occlum.io/) and the [source](https://github.com/occlum/occlum) # `tee`
-   [Huawei](https://www.huawei.com/en/)
    -   Multiple teams & products
-   [Cryptape](https://www.cryptape.com/) # `blockchain`
    -   [CKB](https://github.com/nervosnetwork/ckb)
-   [RivTower 溪塔科技](https://www.rivtower.com/) # `blockchain`
    -   [CITA](https://github.com/citahub/cita)
-   [PingCAP](https://pingcap.com/) # `database`
    -   [TiKV](https://github.com/tikv/tikv)
-   [Bilibili](https://www.bilibili.com/) # `video` `social`
-   [Bytedance](https://www.bytedance.com/en/) # `video` `social`
-   [Zhihu](https://www.zhihu.com/) # `forum`
    -   [Rucene](https://github.com/zhihu/rucene)


## Conferences {#conferences}

[Rust China Conf 2020](https://2020conf.rustcc.cn/) | Shanghai or Shenzhen

-   Source code?
-   Organizing by [RustCC](https://rustcc.cn/)

[RustCon Asia 2019](https://rustcon.asia) | Beijing

-   Source code is on [GitHub](https://github.com/rustcon-asia/beijing-2019)
-   Co-organized by [Cryptape](https://www.cryptape.com/) and [PingCAP](https://pingcap.com/)
-   Announcement: [Hello / 你好 Asia](https://rustcon.asia/blog/hello-asia/)
-   Recap: [A Close Encounter with Rust Community](https://medium.com/@Aimeedeer/a-close-touch-with-rust-community-4a8507b756d9)
-   [Photos](https://www.dropbox.com/sh/t6s39rupk492ntq/AACSMbbeE-uYLqqlyJmXXGUPa?dl=0)
-   [Videos](https://www.youtube.com/watch?v=YSEx8wtlPWc&list=PL85XCvVPmGQjPvweRqkBgnh%5FHKE5MBB8x)


## GitHub Orgs {#github-orgs}

-   <https://github.com/rust-lang-cn>
-   <https://github.com/RustChina>
-   <https://github.com/rust-zh>


## Forums and Channels {#forums-and-channels}


### Forum and media {#forum-and-media}

-   Forum RustCC: <https://rustcc.cn/>
-   WeChat news channel: Rust语言学习交流
-   Telegram news channel: <https://t.me/rust%5Fdaily%5Fnews>


### Telegram {#telegram}

-   <https://t.me/rust%5Fzh>
-   <https://t.me/rust%5Fdeep%5Fwater>
-   <https://t.me/rust%5Ftw>


### WeChat groups {#wechat-groups}

Invite only because of WeChat's limitation.


### QQ groups {#qq-groups}

-   Rust编程语言社区1群，群号：303838735 （已满，只能内部邀请）
-   Rust编程语言社区2群，群号：813448660
-   Rust中文，群号：570065685
-   Topics: 专题群：
    -   Rust Redox发行版开发群，群号：437268658
    -   Rust Data Science 研究小组，群号：681142501
    -   Rust webassembly/wasm社区，群号：347929175
    -   Rust 论坛开发组，群号：687763184
        （关于<https://rust.cc论坛开发相关讨论>）
    -   Rust社群-区块链研究，群号：617238820
    -   Rust 嵌入式开发，群号：825820683
    -   φ Rust图形学，群号：812748521
    -   哲学与计算，群号：446590168
    -   Offline meetups: 地方线下聚会群：
        -   北京：305842562
        -   上海：966129249
        -   深圳：673715651
        -   广州：738772514
        -   成都：131080784
        -   重庆：962149536